### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-auth-lambda"
!       last_modified                  = "2023-08-18T02:34:07.000+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:40",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:32" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:32/invocations" -> (known after apply)
!       s3_key                         = "lambda-builds/67c812ae2031e3212f3eb2734d0238ae9f520472160cdfce55348c3e4f88899b.zip" -> "lambda-builds/f787379b94f7d6a2392a97b5431b5cbdb100aa85167ed0e6708b73121d147789.zip"
!       s3_object_version              = "GKE5BdkZT_b6pMekaa9NM4cg9OApJgat" -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "32" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] will be created
+   resource "aws_lambda_permission" "current_version_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "cataprato-auth-lambda"
+       id                  = (known after apply)
+       principal           = "apigateway.amazonaws.com"
+       qualifier           = (known after apply)
+       source_arn          = "arn:aws:execute-api:us-east-1:350131064538:qkcy9ocpg8/*/*"
+       statement_id        = "APIGatewayAny"
+       statement_id_prefix = (known after apply)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "76cdb2bad9582d23c1f6f4d868218d6c" -> (known after apply)
!       id                     = "lambda-builds/67c812ae2031e3212f3eb2734d0238ae9f520472160cdfce55348c3e4f88899b.zip" -> (known after apply)
!       key                    = "lambda-builds/67c812ae2031e3212f3eb2734d0238ae9f520472160cdfce55348c3e4f88899b.zip" -> "lambda-builds/f787379b94f7d6a2392a97b5431b5cbdb100aa85167ed0e6708b73121d147789.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "./.terraform/lambda-builds/67c812ae2031e3212f3eb2734d0238ae9f520472160cdfce55348c3e4f88899b.zip" -> "./.terraform/lambda-builds/f787379b94f7d6a2392a97b5431b5cbdb100aa85167ed0e6708b73121d147789.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "GKE5BdkZT_b6pMekaa9NM4cg9OApJgat" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "set:filter",
+                       [
+                           "^app(/.*)?$",
                        ],
                    ],
+                   [
+                       "zip",
+                       ".",
+                       null,
                    ],
+                   [
+                       "clear:filter",
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/f787379b94f7d6a2392a97b5431b5cbdb100aa85167ed0e6708b73121d147789.zip"
+               runtime       = "python3.10"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/f787379b94f7d6a2392a97b5431b5cbdb100aa85167ed0e6708b73121d147789.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "239001052082427192" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/67c812ae2031e3212f3eb2734d0238ae9f520472160cdfce55348c3e4f88899b.zip" -> "./.terraform/lambda-builds/f787379b94f7d6a2392a97b5431b5cbdb100aa85167ed0e6708b73121d147789.zip"
!           "timestamp" = "1692325988633789000" -> "1692326738700142000"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "317528117782651525" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/67c812ae2031e3212f3eb2734d0238ae9f520472160cdfce55348c3e4f88899b.zip" -> "./.terraform/lambda-builds/f787379b94f7d6a2392a97b5431b5cbdb100aa85167ed0e6708b73121d147789.zip"
!           "original_source_code" = jsonencode(
!               [
!                   {
-                       commands = [
-                           ":zip . app/",
                        ]
!                       path     = "./app" -> "."
!                       patterns = [
-                           "!app/.*",
+                           "^app(/.*)?$",
                        ]
                    },
                ]
            )
            # (3 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:40" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-18T02:34:07.671+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:40" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/a12005a0246e5329fb177ac5484aa1ad7ca33206aa285182e16e870cf2b2ac3f.zip" -> "builds/f41bee7e121fe4f35f6837515d38b63d5e987ba0f589213b4ef6e11b66648434.zip"
!       s3_object_version           = "yeBZM_6HDFtluNQhRMtRRqpmU6JJ8pxw" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "TqBtcHTnB762k4ousbPoK7hh5u+8dsIMuDKYgazilAw=" -> (known after apply)
!       source_code_size            = 29721215 -> (known after apply)
!       version                     = "40" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "7972e83d7e4b375c8551e5cd63351bad-6" -> (known after apply)
!       id                     = "builds/a12005a0246e5329fb177ac5484aa1ad7ca33206aa285182e16e870cf2b2ac3f.zip" -> (known after apply)
!       key                    = "builds/a12005a0246e5329fb177ac5484aa1ad7ca33206aa285182e16e870cf2b2ac3f.zip" -> "builds/f41bee7e121fe4f35f6837515d38b63d5e987ba0f589213b4ef6e11b66648434.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/a12005a0246e5329fb177ac5484aa1ad7ca33206aa285182e16e870cf2b2ac3f.zip" -> "builds/f41bee7e121fe4f35f6837515d38b63d5e987ba0f589213b4ef6e11b66648434.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "yeBZM_6HDFtluNQhRMtRRqpmU6JJ8pxw" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/f41bee7e121fe4f35f6837515d38b63d5e987ba0f589213b4ef6e11b66648434.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/f41bee7e121fe4f35f6837515d38b63d5e987ba0f589213b4ef6e11b66648434.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "2733925318803953813" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/a12005a0246e5329fb177ac5484aa1ad7ca33206aa285182e16e870cf2b2ac3f.zip" -> "builds/f41bee7e121fe4f35f6837515d38b63d5e987ba0f589213b4ef6e11b66648434.zip"
!           "timestamp" = "1692325990330988000" -> "1692326721293859000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "9120285258764984666" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/a12005a0246e5329fb177ac5484aa1ad7ca33206aa285182e16e870cf2b2ac3f.zip" -> "builds/f41bee7e121fe4f35f6837515d38b63d5e987ba0f589213b4ef6e11b66648434.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 1 to change, 7 to destroy.
```
</details>